app/Http/Controllers/MajorController.php

    public function update(UpdateMajorRequest $request, $majorId)
    {
        $object = $this->model->find($majorId);
        $object->fill($request->except('_token'));
        $object->save();
---
update `majors` set `name` = 'hoang' where `id` = 1